
# specify directory to install casks
cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'adoptopenjdk/openjdk'
tap 'versent/homebrew-taps'
#tap 'jeffreywildman/homebrew-virt-manager'
#tap 'jenkins-x/jx'

brew 'pyenv'

brew 'ansible'
brew 'asdf'
brew 'awscli'
brew 'curl'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'helm'
brew 'helmfile'
#brew 'solo-io/tap/glooctl'
brew 'golang'
#brew 'helm'
#brew 'helm@2'
brew 'hub'
#brew 'istioctl'
brew 'jq'
#brew 'jx'
brew 'kubernetes-helm'
brew 'kubeseal'
#brew 'kubectx'
#brew 'kubectl'
brew 'kustomize'
#brew 'minikube'
brew 'maven'
brew 'node'
brew 'openshift-cli'
brew 'openssl'
brew 'saml2aws'
brew 'sops'
brew 'telnet'
brew 'terraform_landscape'
brew 'tree'
brew 'tfenv'
brew 'wget'
#brew 'virt-manager'
brew 'zsh'
brew 'zsh-completions'

# AWS
# brew 'aws-vault'



# Intellij Idea
# cask 'intellij-idea-ce'
cask 'intellij-idea'

cask 'adoptopenjdk8'
cask 'atom'
cask 'docker'
cask 'evernote'
#cask 'firefox'
#cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'java'
cask 'keybase'
#cask 'microsoft-teams'
cask 'openvpn-connect'
cask 'postman'
cask 'rocket'
cask 'slack'
cask 'spotify'
cask 'vagrant'
#cask 'virtualbox'
cask 'visual-studio-code'
#cask 'whatsapp'


# Database
# brew 'postgresql'






