
# specify directory to install casks
cask_args appdir: '/Applications'

tap 'adoptopenjdk/openjdk'
tap 'argoproj/tap'
tap 'derailed/k9s'
tap 'homebrew/cask'
#tap 'jeffreywildman/homebrew-virt-manager'
#tap 'jenkins-x/jx'
tap 'starkandwayne/cf'
tap 'versent/homebrew-taps'
#tap '-x/jx'

brew 'pyenv'

#brew 'ansible'
brew 'argo'
brew 'argocd'
brew 'asciidoctor'
brew 'kubectl-argo-rollouts'
brew 'awscli'
brew 'cookiecutter'
brew 'curl'
brew 'dnsmasq'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gradle'
brew 'helm'
brew 'helmfile'
brew 'istioctl'
brew 'lnav'
#brew 'solo-io/tap/glooctl'
brew 'golang'
#brew 'helm'
#brew 'helm@2'
brew 'httpie'
brew 'hub'
#brew 'istioctl'
brew 'jq'
#brew 'jx'
<<<<<<< HEAD
brew 'kn'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kubectl'
brew 'k9s'
brew 'minikube'
=======
brew 'k9s'
#brew 'kubernetes-helm'
brew 'kubeseal'
#brew 'kubectx'
#brew 'kubectl'
brew 'kustomize'
#brew 'minikube'
>>>>>>> cb5824c8f97c0f14e5a26c8c1e94f145910456d1
brew 'maven'
brew 'node'
brew 'openssl'
<<<<<<< HEAD
brew 'skaffold'
=======
brew 'saml2aws'
brew 'spruce'
brew 'sops'
brew 'stern'
brew 'tektoncd-cli'
brew 'telnet'
>>>>>>> cb5824c8f97c0f14e5a26c8c1e94f145910456d1
brew 'terraform_landscape'
brew 'tree'
brew 'tfenv'
#brew 'virt-manager'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'zsh-completions'

# AWS
# brew 'aws-vault'



# Intellij Idea
# cask 'intellij-idea-ce'
cask 'intellij-idea'

cask 'adoptopenjdk8'
cask 'atom'
cask 'docker'
cask 'evernote'
#cask 'firefox'
#cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'java'
cask 'keybase'
#cask 'microsoft-teams'
# cask 'openvpn-connect'
cask 'postman'
cask 'rocket'
cask 'slack'
cask 'spotify'
<<<<<<< HEAD
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
=======
#cask 'vagrant'
#cask 'virtualbox'
#cask 'visual-studio-code'
>>>>>>> cb5824c8f97c0f14e5a26c8c1e94f145910456d1
#cask 'whatsapp'


# Database
# brew 'postgresql'






