
# specify directory to install casks
cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'adoptopenjdk/openjdk'
#tap 'jenkins-x/jx'

brew 'pyenv'
# brew 'slack'

cask 'adoptopenjdk8'
brew 'ansible'
brew 'awscli'
brew 'curl'
brew 'gnu-sed'
#brew 'solo-io/tap/glooctl'
brew 'golang'
#brew 'helm'
brew 'helm@2'
brew 'hub'
brew 'jq'
#brew 'jx'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kubectl'
brew 'minikube'
brew 'maven'
brew 'openssl'
brew 'terraform_landscape'
brew 'tfenv'
brew 'wget'

# AWS
# brew 'aws-vault'



# Intellij Idea
cask 'intellij-idea-ce'
# cask 'intellij-idea'

cask 'docker'
cask 'evernote'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'google-chrome'
cask 'keybase'
cask 'firefox'
cask 'rocket'
#cask 'slack'
cask 'spotify'
cask 'vagrant'
#cask 'virtualbox'
cask 'visual-studio-code'
#cask 'whatsapp'


# Database
# brew 'postgresql'






